{
    "weapon-specal":[
        {   "id": "storm",
            "name":"Storm",
            "description":"Firing with a hail of shots, these weapons strike so rapidly that enemies are filled with metal in an instant. This quality doubles the number of hits the weapon inflicts on the target and the amount of ammunition expended. For example, when firing a weapon with the Storm quality in fully automatic mode, each degree of success yields two additional hits (up to the weapon’s firing rate, as normal)."
        },
        {   "id": "tearing",
            "name":"Tearing",
            "description":"These weapons call on spinning chainblades, serrated claws, burrowing projectiles, and other vicious means to rip apart targets. These weapons roll one extra die for damage, and the lowest result is discarded."
        }
    ],
    "weapons": [
        {   "id":"boltpistol",
            "name":"Bolt Pistol",
            "cls":"Pistol",
            "rng":"30m",
            "rof":"S/2/-",
            "dam":"1d10+5X",
            "pen":4,
            "clip":8,
            "rld":"Full",
            "specal":["Tearing"],
            "wt":"3.5kg",
            "avl":"Very Rare",
            "description":"Both a status symbol and puissant weapon, bolt pistols are rare in numbers but always feared. In the hands of an Imperial Guard Commissar, one can reverse a cowardly retreat; in the hands of an Inquisitor, it can stop a cult leader from summoning an unholy Daemon. Such is their power, both symbolic and physical, that many eagerly sacrifice all to possess one."
        },
        {   "id":"boltgun",
            "name":"Boltgun",
            "cls":"Basic",
            "rng":"100m",
            "rof":"S/3/-",
            "dam":"1d10+5X",
            "pen":4,
            "clip":24,
            "rld":"Full",
            "specal":["Tearing"],
            "wt":"7kg",
            "avl":"Very Rare",
            "description":"Boltguns, or bolters as they are often called, are the main weapon of the Space Marines, who carry versions so huge that few humans can easily lift one, let alone fire it. The lighter models others use to serve the Emperor are only slightly less destructive, but still powerful enough to destroy any who oppose His Will."
        },
        {   "id":"boltheavy",
            "name":"Heavy Bolter",
            "cls":"Heavy",
            "rng":"150m",
            "rof":"-/-/6",
            "dam":"1d10+8X",
            "pen":5,
            "clip":60,
            "rld":"Full",
            "specal":["Tearing"],
            "wt":"40kg",
            "avl":"Very Rare",
            "description":"This huge weapon is rarely used outside of military forces, but sometimes is all that stands against some of the terrors of the Ruinous Powers. The larger shells carry additional propellant and stronger explosive charges, making them deadly against armoured foes at long ranges."
        },
        {   "id":"boltstorm",
            "name":"Storm Bolter",
            "cls":"Basic",
            "rng":"90m",
            "rof":"S/2/4",
            "dam":"1d10+5X",
            "pen":4,
            "clip":60,
            "rld":"Full",
            "specal":["Storm", "Tearing"],
            "wt":"9kg",
            "avl":"Extremely Rare",
            "description":"Storm bolters combine the firing power of two boltguns into one compact weapon. They fire an unstoppable hail of metal that can tear apart groups of enemies in a single salvo, and can bring a furious charge to a dead halt in moments."
        }
    ]
}