{
    "weapon-specal":[
        {   "id": "storm",
            "name":"Storm",
            "description":"Firing with a hail of shots, these weapons strike so rapidly that enemies are filled with metal in an instant. This quality doubles the number of hits the weapon inflicts on the target and the amount of ammunition expended. For example, when firing a weapon with the Storm quality in fully automatic mode, each degree of success yields two additional hits (up to the weapon’s firing rate, as normal)."
        },
        {   "id": "tearing",
            "name":"Tearing",
            "description":"These weapons call on spinning chainblades, serrated claws, burrowing projectiles, and other vicious means to rip apart targets. These weapons roll one extra die for damage, and the lowest result is discarded."
        },
        {   "id":"accurate",
            "name":"Accurate",
            "description": "The weapon is crafted for precision attacks, with perfectly crafted las-lenses or finely honed barrels. This grants an additional bonus of +10 to the firer’s Ballistic Skill when used with an Aim action, in addition to the normal bonus granted from Aiming. When a character fires a single shot from a single Basic weapon with the Accurate quality while benefitting from the Aim action, the attack inflicts an additional 1d10 damage for every two degrees of success beyond the first (to a maximum of an extra 2d10). These extra d10s cannot generate Righteous Fury."
        },
        {   "id":"Balanced",
            "name":"Balanced",
            "description": "Carefully weighted, the weapon moves naturally with the user, making his parries more successful. Balanced weapons grant a +10 bonus to Weapon Skill tests made to Parry. Even if the wielder is using multiple Balanced weapons, he only gains the bonus once."
        },
        {   "id":"blast (X)",
            "name":"Blast",
            "description": "Attacks from this weapon explode on impact, hurling debris and shrapnel in all directions. When working out a hit from a Blast weapon, anyone within the weapon’s blast radius in metres, indicated by the number in parentheses, is also suffers a single hit from the weapon. Roll damage once and apply it to each character affected by the blast. A Blast weapon also scatters when the user fails his Ballistic Skill test when firing it (see page 230)."
        },
        {   "id":"concussive (X)",
            "name":"Concussive",
            "description": "Concussive weapons strike with a powerful impact strong enough to temporarily knock a foe senseless. When a target is struck by a Concussive weapon, he must take a Toughness test with a penalty equal to 10 times the number in parentheses (X). For example, a weapon with Concussive (2) would impose a –20 on this Toughness test and Concussive (0) would cause a test with no penalty. If he fails, the target is Stunned for 1 round per degree of failure. If the attack also inflicted an amount of damage greater than the target’s Strength bonus, the target is knocked Prone."
        },
        {   "id":"Corrosive",
            "name":"Corrosive",
            "description": "These weapons utilise highly caustic acids which cause damage to both the target and his equipment. If a target is struck by an attack from a Corrosive weapon, the Armour points of any armour worn by the target in that location are reduced by 1d10 points. If the Armour points of the armour are reduced below 0 or the target is not wearing any armour in that location, the excess amount of Armour point damage (or the whole amount if the target is wearing no armour in that location) is dealt to the target. This excess damage is not reduced by Toughness. A target’s armour can be reduced multiple times by the effects of a Corrosive weapon, and the Armour point damage is cumulative. A suit of armour can be repaired with a successful Challenging (+0) Tech-Use test, and an Acolyte who possesses the Armour Monger talent can repair the armour while making use of that talent."
        }
    ],
    "weapon": [
        {   "id":"boltpistol",
            "name":"Bolt Pistol",
            "cls":"Pistol",
            "rng":"30m",
            "rof":"S/2/-",
            "dam":"1d10+5X",
            "pen":4,
            "clip":8,
            "rld":"Full",
            "specal":["tearing"],
            "wt": 3.5,
            "avl":"Very Rare",
            "description":"Both a status symbol and puissant weapon, bolt pistols are rare in numbers but always feared. In the hands of an Imperial Guard Commissar, one can reverse a cowardly retreat; in the hands of an Inquisitor, it can stop a cult leader from summoning an unholy Daemon. Such is their power, both symbolic and physical, that many eagerly sacrifice all to possess one."
        },
        {   "id":"boltgun",
            "name":"Boltgun",
            "cls":"Basic",
            "rng":"100m",
            "rof":"S/3/-",
            "dam":"1d10+5X",
            "pen":4,
            "clip":24,
            "rld":"Full",
            "specal":["tearing"],
            "wt": 7,
            "avl":"Very Rare",
            "description":"Boltguns, or bolters as they are often called, are the main weapon of the Space Marines, who carry versions so huge that few humans can easily lift one, let alone fire it. The lighter models others use to serve the Emperor are only slightly less destructive, but still powerful enough to destroy any who oppose His Will."
        },
        {   "id":"heavybolter",
            "name":"Heavy Bolter",
            "cls":"Heavy",
            "rng":"150m",
            "rof":"-/-/6",
            "dam":"1d10+8X",
            "pen":5,
            "clip":60,
            "rld":"Full",
            "specal":["tearing"],
            "wt": 40,
            "avl":"Very Rare",
            "description":"This huge weapon is rarely used outside of military forces, but sometimes is all that stands against some of the terrors of the Ruinous Powers. The larger shells carry additional propellant and stronger explosive charges, making them deadly against armoured foes at long ranges."
        },
        {   "id":"stormbolter",
            "name":"Storm Bolter",
            "cls":"Basic",
            "rng":"90m",
            "rof":"S/2/4",
            "dam":"1d10+5X",
            "pen":4,
            "clip":60,
            "rld":"Full",
            "specal":["storm", "tearing"],
            "wt": 9,
            "avl":"Extremely Rare",
            "description":"Storm bolters combine the firing power of two boltguns into one compact weapon. They fire an unstoppable hail of metal that can tear apart groups of enemies in a single salvo, and can bring a furious charge to a dead halt in moments."
        }
    ]
}